load/test.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://jhunufernandes.com.br
  phases:
    - duration: 300
      arrivalRate: 1
      rampTo: 50
      name: Warm up phase
    - duration: 300
      arrivalRate: 50
      rampTo: 500
      name: Ramp up load
    - duration: 300
      arrivalRate: 500
      rampTo: 5000
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/"
        # - get:
        #     url: "/dino"
        # - get:
        #     url: "/pony"
        # - get:
        #     url: "/armadillo"
        count: 100